preorder.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-01-26 Thu 15:12 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgad35e7a">1. preorder 預序</a>
<ul>
<li><a href="#org61ffc4f">1.1. upper/lower bound</a></li>
<li><a href="#org662187b">1.2. greatest/least element</a></li>
<li><a href="#orgbc3748e">1.3. maximal/minimal</a></li>
<li><a href="#orgf41ace4">1.4. join/meet</a>
<ul>
<li><a href="#org1e4be03">1.4.1. singleton has only one meet/join</a></li>
<li><a href="#org21ca2ab">1.4.2. empty set</a></li>
</ul>
</li>
<li><a href="#orge83d2a6">1.5. up/down set</a></li>
<li><a href="#org8be9faa">1.6. chain</a>
<ul>
<li><a href="#org1f742e2">1.6.1. ω-chain</a></li>
<li><a href="#orgffd2cbd">1.6.2. anti-chain</a></li>
</ul>
</li>
<li><a href="#org18dece9">1.7. reflect order</a></li>
<li><a href="#orgf659a1e">1.8. order preserving</a></li>
<li><a href="#org31cd1ed">1.9. function order</a></li>
</ul>
</li>
<li><a href="#org94980d4">2. proposition</a>
<ul>
<li><a href="#org23781fa">2.1. Identity function on any preordered set is monotone</a></li>
<li><a href="#org21e052e">2.2. Composition of two monotone functions is monotone</a></li>
<li><a href="#orgf7b8be5">2.3. Compose function between preordered sets is monotone</a></li>
<li><a href="#orgdb55247">2.4. f : X × Y → Z is monotone, if it's monotone in each variable separately</a></li>
</ul>
</li>
<li><a href="#org4680804">3. poset (preoder free from powerset)</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgad35e7a" class="outline-2">
<h2 id="orgad35e7a"><span class="section-number-2">1</span> preorder 預序</h2>
<div class="outline-text-2" id="text-1">
<p>
A preorder is a relation on set X, such that, two elements of x, y ∈ X we can discuss x ≤ y.
</p>

<p>
The following definition are quite important for preorder, we will assume
</p>

<ul class="org-ul">
<li>set X</li>
<li>A ⊆ X</li>
</ul>
</div>

<div id="outline-container-org61ffc4f" class="outline-3">
<h3 id="org61ffc4f"><span class="section-number-3">1.1</span> upper/lower bound</h3>
<div class="outline-text-3" id="text-1-1">
<p>
An element x ∈ X is an upper bound of A, iff ∀ a ∈ A, a ≤ x
</p>

<p>
Reversely, x ∈ X is a lower bound of A, iff ∀ a ∈ A, x ≤ a
</p>
</div>
</div>

<div id="outline-container-org662187b" class="outline-3">
<h3 id="org662187b"><span class="section-number-3">1.2</span> greatest/least element</h3>
<div class="outline-text-3" id="text-1-2">
<p>
An upper bound x of A is the greatest element iff x ∈ A
</p>

<p>
Reversely, lower bound x of A is the least element iff x ∈ A
</p>
</div>
</div>

<div id="outline-container-orgbc3748e" class="outline-3">
<h3 id="orgbc3748e"><span class="section-number-3">1.3</span> maximal/minimal</h3>
<div class="outline-text-3" id="text-1-3">
<p>
An element a ∈ A is maximal, if ∀ b, a ≤ b implies a ≅ b
</p>

<p>
Reversely, a ∈ A is minimal, if ∀ b, b ≤ a implies b ≅ a
</p>
</div>
</div>

<div id="outline-container-orgf41ace4" class="outline-3">
<h3 id="orgf41ace4"><span class="section-number-3">1.4</span> join/meet</h3>
<div class="outline-text-3" id="text-1-4">
<p>
A join of A is that, a least element of the set of upper bounds for A (called least upper bound or supremum, sometimes)
</p>

<p>
A meet of A is, a greatest element of the set of lower bounds for A (called greatest lower bound or infimum, sometimes)
</p>

<ol class="org-ol">
<li>The syntax ∨A is a choice of one of the joins of A</li>
<li>The syntax ∧A is a choice of one of the meets of A</li>
<li>∀ x ∈ X, ∨A ≤ x ⟹ A ≤ x</li>
<li>∀ x ∈ X, x ≤ ∧A ⟹ x ≤ A</li>
</ol>
</div>

<div id="outline-container-org1e4be03" class="outline-4">
<h4 id="org1e4be03"><span class="section-number-4">1.4.1</span> singleton has only one meet/join</h4>
<div class="outline-text-4" id="text-1-4-1">
<p>
∨{x} = ∧{x} = x
</p>
</div>
</div>

<div id="outline-container-org21ca2ab" class="outline-4">
<h4 id="org21ca2ab"><span class="section-number-4">1.4.2</span> empty set</h4>
<div class="outline-text-4" id="text-1-4-2">
<p>
The ∨∅ called ⊥, if it existed, ⊥ ≤ x
</p>

<p>
The ∧∅ called ⊤, if it existed, x ≤ ⊤
</p>
</div>
</div>
</div>

<div id="outline-container-orge83d2a6" class="outline-3">
<h3 id="orge83d2a6"><span class="section-number-3">1.5</span> up/down set</h3>
<div class="outline-text-3" id="text-1-5">
<p>
A up-set of A is { x ∈ X | A ≤ x }, written A↑
</p>

<p>
Reversely, a down-set of A is { x ∈ X | x ≤ A }, written A↓
</p>

<p>
Notice that, if write x↑ for x ∈ X, then it's {x}↑
</p>

<p>
Reversely, x↓ = {x}↓
</p>
</div>
</div>

<div id="outline-container-org8be9faa" class="outline-3">
<h3 id="org8be9faa"><span class="section-number-3">1.6</span> chain</h3>
<div class="outline-text-3" id="text-1-6">
<p>
If ∀ x, y ∈ A, we have x ≤ y or y ≤ x, which means we always have relation result for any two elements, then we say A is a <b>chain</b>
</p>
</div>

<div id="outline-container-org1f742e2" class="outline-4">
<h4 id="org1f742e2"><span class="section-number-4">1.6.1</span> ω-chain</h4>
<div class="outline-text-4" id="text-1-6-1">
<p>
If a <b>chain</b> can be indexed by ℕ, it's a ω-chain
</p>
</div>
</div>

<div id="outline-container-orgffd2cbd" class="outline-4">
<h4 id="orgffd2cbd"><span class="section-number-4">1.6.2</span> anti-chain</h4>
<div class="outline-text-4" id="text-1-6-2">
<p>
If ∀ x, y ∈ A, x ≤ y ⟹  y ≤ x, A is a <b>anti-chain</b>
</p>
</div>
</div>
</div>

<div id="outline-container-org18dece9" class="outline-3">
<h3 id="org18dece9"><span class="section-number-3">1.7</span> reflect order</h3>
<div class="outline-text-3" id="text-1-7">
<p>
A function <i>f</i> is said to <b>reflect order</b> if given any x, y ∈ X, f(x) ≤ f(y) ⟹  x ≤ y
</p>
</div>
</div>

<div id="outline-container-orgf659a1e" class="outline-3">
<h3 id="orgf659a1e"><span class="section-number-3">1.8</span> order preserving</h3>
<div class="outline-text-3" id="text-1-8">
<p>
A monotone function can also be said it's <b>order preserving</b>
</p>
</div>
</div>

<div id="outline-container-org31cd1ed" class="outline-3">
<h3 id="org31cd1ed"><span class="section-number-3">1.9</span> function order</h3>
<div class="outline-text-3" id="text-1-9">
<p>
We can also scale order to function,
</p>

<p>
f ≤ g, if ∀ x ∈ X, f(x) ≤ g(x)
</p>

<p>
where f, g : X → Y
</p>
</div>
</div>
</div>

<div id="outline-container-org94980d4" class="outline-2">
<h2 id="org94980d4"><span class="section-number-2">2</span> proposition</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org23781fa" class="outline-3">
<h3 id="org23781fa"><span class="section-number-3">2.1</span> Identity function on any preordered set is monotone</h3>
</div>
<div id="outline-container-org21e052e" class="outline-3">
<h3 id="org21e052e"><span class="section-number-3">2.2</span> Composition of two monotone functions is monotone</h3>
</div>
<div id="outline-container-orgf7b8be5" class="outline-3">
<h3 id="orgf7b8be5"><span class="section-number-3">2.3</span> Compose function between preordered sets is monotone</h3>
<div class="outline-text-3" id="text-2-3">
<p>
Consider X, Y, Z be preordered sets
</p>

<p>
∘ : (Y -&gt; Z) × (X -&gt; Y) → (X → Z)
</p>

<p>
∘ (g, f) = λ x . g (f x)
</p>

<p>
The compose function ∘ is monotone between preordered sets
</p>
</div>
</div>

<div id="outline-container-orgdb55247" class="outline-3">
<h3 id="orgdb55247"><span class="section-number-3">2.4</span> f : X × Y → Z is monotone, if it's monotone in each variable separately</h3>
<div class="outline-text-3" id="text-2-4">
<p>
details, it said
</p>

<p>
x ≤ x' ⟹  f(x, y) ≤ f(x', y)
</p>

<p>
and
</p>

<p>
y ≤ y' ⟹  f(x, y) ≤ f(x, y')
</p>
</div>
</div>
</div>

<div id="outline-container-org4680804" class="outline-2">
<h2 id="org4680804"><span class="section-number-2">3</span> poset (preoder free from powerset)</h2>
<div class="outline-text-2" id="text-3">
<p>
<b>poset</b> is an interesting instance, its the preorder free from a powerset of any set X
</p>

<p>
The ⊆ is the ≤ here, for any two elements of powerset a, b ∈ P(X)
</p>

<ul class="org-ul">
<li>a ⋃ b is a ∨ b</li>
<li>a ⋂ b is a ∧ b</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2023-01-26 Thu 15:12</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
